{

  "specialEvents": [
    {
      "name": "Uncanny Figments",
      "descriptionHtml": [ "For this celebratory 5th edition, we are thrilled to share the work of an outstanding guest and artist, <a href=\"http://daniel-ursache.com/\" target=\"_blank\">Daniel Ursache</a>. His exhibition, <b>\"Uncanny Figments\"</b>, will be hosted by <b>A/NT Gallery</b> throughout November." ],
      "date": "2018-11-03T07:00:00.000Z",
      "startTime": "2018-11-04T03:00:00.000Z",
      "location": "A/NT Gallery",
      "imagePath": "film_fest_2018/uncanny_figments.jpg",
      "locationLink": "https://goo.gl/maps/631CakMwHTm"
    }
  ],
  "partners": [
    {
      "link": "http://www.icrny.org/",
      "imagePath": "icr_ny.png"
    },
    {
      "link": "http://www.4culture.org/",
      "imagePath": "4culture.png"
    },
    {
      "link": "https://cedarriverah.com/",
      "imagePath": "cedar_river.jpg"
    },
    {
      "link": "https://www.cityartsmagazine.com/",
      "imagePath": "city_arts.png"
    }
  ],
  "sponsors": [
    {
      "link": "http://www.carsonnoel.com/",
      "imagePath": "carsonnoel.jpg"
    },
    {
      "link": "http://www.nwfamilydental.net/",
      "imagePath": "nw_family_dental.jpg"
    }
  ],
  "films": [
    {
      "name": "Untamed Romania",
      "description": [ "\"Untamed Romania\" explores \"one of the wildest and most beautiful parts of Europe\", from the mysterious Danube Delta to the unknown Carpathian forests. Wolves, bears, and lynx roam the vast forests where almost all the original flora and fauna still exist left untouched since time immemorial. There is no other location of comparable size with such pristine nature in Europe. This unique documentary is narrated by award-winning Romanian film and stage actor Victor Rebengiuc." ],
      "artist": "Tom Barton-Humphreys",
      "length": "90 minutes",
      "genres": "Documentary",
      "imagePath": "romania_neimblanzita1.jpg",
      "year": "2018"
    },
    {
      "name": "One Step Behind the Seraphim",
      "description": [
        "The feature tells the story of Gabriel (Stefan Iancu), a teenager who wants to be a priest and has been recently admitted to a theological seminary. Trying to fit in first, he is fast to discover a world of fear and abuse. Lying, cheating and betraying are things the freshmen have to master in order to survive their seniors’ constant bullying and the game of power and manipulation fed by a tough teacher (remarkably played by Vlad Ivanov). This caustic coming of age movie calls to mind boarding-school-set movies where oppression and brutality are widespread.",
        "After having taken 10 years to film, \"One Step behind the Seraphim\" swept Romania’s Gopo Awards in 2018. It won 8 statuettes, including the most important trophies: Best Film, Best Film Director, Best Script, Best Debut Feature, Best Leading Actor, Best Picture and Young Hope, together with the Award of the Romanian Society of Cinematographers. It also received the Audience Award at Transylvania Film Festival."
      ],
      "artist": "Daniel Sandu",
      "length": "150 minutes",
      "genres": "Drama",
      "imagePath": "seraphim_poster.jpg",
      "year": "2017"
    }
  ],
  "guests": [
    {
      "name": "Daniel Sandu",
      "imagePath": "daniel_sandu.jpg",
      "details": "Before starting his career in film, Daniel Sandu studied theology at the Orthodox Seminary \"Saint George\" in the North-East of Romania. He wrote and directed feature films, shorts and TV shows. In 2011, his short \"The Counting Device\", co-produced with Ada Solomon, was selected in official competitions of prestigious film festivals at Sarajevo, Cambridge, Montpellier, Leuven and won the Jury Prize in Leiden. In 2013 he got the Special Prize at the Anonymous Festival in Romania, for his film \"The Second Voice\". \"Horsepower\" was awarded the Prize for the Best Short a year later at the Locarno Film Festival. He continued his collaboration with Ada Solomon for his debut with \"One Step behind the Seraphim\", a film that swept Romania’s Gopo Awards last year. Daniel is now working on a TV series for HBO Romania and on his second feature movie- \"Father Moves Mountains/Tatăl mută munții\" produced by Cristian Mungiu (Mobra Films). This project received the ARTE award at Les Arcs in 2016."
    }
  ]
}
