{

  "specialEvents": [
    {
      "name": "Uncanny Figments",
      "descriptionHtml": [ "For this celebratory 5th edition, we are thrilled to share the work of an outstanding guest and artist, <a href=\"http://daniel-ursache.com/\" target=\"_blank\">Daniel Ursache</a>. His exhibition, <b>\"Uncanny Figments\"</b>, will be hosted by <b>A/NT Gallery</b> throughout November." ],
      "date": "2018-11-03T07:00:00.000Z",
      "startTime": "2018-11-04T03:00:00.000Z",
      "location": "A/NT Gallery",
      "imagePath": "film_fest_2018/uncanny_figments.jpg",
      "locationLink": "https://goo.gl/maps/631CakMwHTm",
      "id": "uncannyfigments"
    }
  ],
  "officialPartners": [
    {
      "link": "http://www.icrny.org/",
      "imagePath": "icr_ny.png"
    },
    {
      "link": "https://www.siff.net",
      "imagePath": "siff.png"
    },
    {
      "link": "http://www.4culture.org/",
      "imagePath": "4culture.png"
    },
    {
      "link": "https://www.cityartsmagazine.com/",
      "imagePath": "city_arts.png"
    },
    {
      "link": "https://www.thestranger.com",
      "imagePath": "stranger.png"
    }
  ],
  "partners": [
    {
      "link": "https://cedarriverah.com/",
      "imagePath": "cedar_river.jpg"
    },
    {
      "link": "https://www.bhgre.com/Better-Homes-and-Gardens-Real-Estate-Macy-%26-Co.-44181c/Nadia-Schmieder-4989949a",
      "imagePath": "nadia_schmieder.jpg"
    },
    {
      "link": "http://www.traduterra.com",
      "imagePath": "traduterra.png"
    }
  ],
  "sponsors": [
    {
      "link": "http://www.carsonnoel.com/",
      "imagePath": "carsonnoel.jpg"
    },
    {
      "link": "http://www.nwfamilydental.net/",
      "imagePath": "nw_family_dental.jpg"
    },
    {
      "link": "https://advanceddentistryatcenturysquare.com/",
      "imagePath": "advanced_dentistry.jpg"
    },
    {
      "link": "https://theevergrey.com/",
      "imagePath": "evergrey.jpg"
    }
  ],
  "films": [
    {
      "name": "Untamed Romania",
      "description": [ "\"Untamed Romania\" explores \"one of the wildest and most beautiful parts of Europe\", from the mysterious Danube Delta to the unknown Carpathian forests. Wolves, bears, and lynx roam the vast forests where almost all the original flora and fauna still exist left untouched since time immemorial. There is no other location of comparable size with such pristine nature in Europe. This unique documentary is narrated by award-winning Romanian film and stage actor Victor Rebengiuc." ],
      "artist": "Tom Barton-Humphreys",
      "length": "90 minutes",
      "genres": "Documentary",
      "imagePath": "romania_neimblanzita1.jpg",
      "year": "2018",
      "id": "untamed"
    },
    {
      "name": "One Step Behind the Seraphim",
      "description": [
        "The feature tells the story of Gabriel (Stefan Iancu), a teenager who wants to be a priest and has been recently admitted to a theological seminary. Trying to fit in first, he is fast to discover a world of fear and abuse. Lying, cheating and betraying are things the freshmen have to master in order to survive their seniors’ constant bullying and the game of power and manipulation fed by a tough teacher (remarkably played by Vlad Ivanov). This caustic coming of age movie calls to mind boarding-school-set movies where oppression and brutality are widespread.",
        "After having taken 10 years to film, \"One Step behind the Seraphim\" swept Romania’s Gopo Awards in 2018. It won 8 statuettes, including the most important trophies: Best Film, Best Film Director, Best Script, Best Debut Feature, Best Leading Actor, Best Picture and Young Hope, together with the Award of the Romanian Society of Cinematographers. It also received the Audience Award at Transylvania Film Festival."
      ],
      "artist": "Daniel Sandu",
      "length": "150 minutes",
      "genres": "Drama",
      "imagePath": "seraphim_poster.jpg",
      "year": "2017",
      "id": "seraphim"
    },
    {
      "name": "D-Love",
      "description": [
        "A couple with longstanding marital issues lands at LAX after a getaway in Europe. For a few years now, Stefania has been working a job she detests and Dan hasn't worked at all. Their palpable strain is only made worse when a Danish vagabond asks for a ride to the busiest freeway in Los Angeles. Stefania doesn’t want to have anything to do with the hippie looking wanderer, but her husband Dan, much to his wife's horror, offers to bring this total stranger to their home. How will their encounter with this uncanny character affect their marriage? The director invites you on a 3 day journey, seen through Stefania’s eyes, to view and discover that desired change doesn’t always come in the package that we want or expect."
      ],
      "artist": "Elena Beuca",
      "length": "96 minutes",
      "genres": "Drama",
      "imagePath": "d_love.jpg",
      "year": "2018",
      "id": "d-love"
    },
    {
      "name": "Miss Christina",
      "description": [
        "\"Miss Christina\" is the dramatization of a 1936 novella written by the famous Romanian author and historian of religions, Mircea Eliade. Considered the first Romanian title of the Gothic genre, the film brings its distinct supernatural touch, being deeply rooted in East-European folklore and pagan mythology. It tells the love story between a human and the vampire-like character of a gorgeous young woman who died a violent death in the bloody peasant revolts in Romania in 1907. Known in Romanian as a moroi or a strigoi, Miss Christina comes back from the grave to seduce her niece's fiancé, Egor (played by Tudor Istodor), during his first visit to the countryside family mansion. The lady of the house (played by <a href=\"#maia-morgenstern\">Maia Morgenstern</a>) worships her dead sister’s memory, even to the detriment of her own daughter's sanity and safety. When Egor realizes that his fiancé's life is endangered by his unexplainable lust for Miss Cristina, he decides to fight the moroi."
      ],
      "artist": "Alexandru Maftei",
      "length": "101 minutes",
      "genres": "Gothic Horror, Mystery, Drama",
      "imagePath": "miss_christina.jpg",
      "year": "2013",
      "id": "miss-christina"
    }
  ],
  "guests": [
    {
      "name": "Maia Morgenstern",
      "imagePath": "maia_morgenstern.jpg",
      "details": "Legendary Maia Morgenstern has often been described as the \"symbol of Romanian theater and film\" (Florin Mitu, AMOS News). Born in a Jewish family in Bucharest, she studied at the Film and Theatre Academy and went on to become a member of the repertory companies of three prominent Romanian theater organizations — the Piatra Neamț National Theatre (1985 – 1988), the State Jewish Theatre (1988 – present) and the National Theatre (1990 – present). She made her film debut in 1983 with <i>Too Hot for May/ Prea cald pentru luna mai</i>. Since then she has appeared in dozens of Romanian feature films, as well as several international productions, including the English-language <i>Nostradamus</i> (1994), starring F. Murray Abraham and Tchéky Karyo; the Hungarian-language <i>Siódmy pokój</i> (1995) , the English/Greek language <i>Ulysses’ Gaze</i> (1995), in which she co-starred with Harvey Keitel, and the French language feature <i>Marie, Nonna, la vierge et moi</i> (2000). Morgenstern also took on a role in the USA Network TV movie <i>Dark Prince: The True Story of Dracula</i> (2000). She is probably best known for the role of Mary, mother of Jesus, in Mel Gibson's <i>The Passion of the Christ</i> (2004). She performed her role in Aramaic, but unlike the other actors in the cast of the film, she simply memorized her lines phonetically. In Romania, she has been nationally known since her 1992 role as Nela in Lucian Pintilie’s <i>Balanța/ The Oak</i>, set during the waning days of Communist Romania.",
      "photoCaption": "Photo credit: Bogdan Stăncescu",
      "id": "maia-morgenstern"
    },
    {
      "name": "Daniel Sandu",
      "imagePath": "daniel_sandu.jpg",
      "details": "Before starting his career in film, Daniel Sandu studied theology at the Orthodox Seminary \"Saint George\" in the North-East of Romania. He wrote and directed feature films, shorts and TV shows. In 2011, his short \"The Counting Device\", co-produced with Ada Solomon, was selected in official competitions of prestigious film festivals at Sarajevo, Cambridge, Montpellier, Leuven and won the Jury Prize in Leiden. In 2013 he got the Special Prize at the Anonymous Festival in Romania, for his film \"The Second Voice\". \"Horsepower\" was awarded the Prize for the Best Short a year later at the Locarno Film Festival. He continued his collaboration with Ada Solomon for his debut with \"One Step behind the Seraphim\", a film that swept Romania’s Gopo Awards last year. Daniel is now working on a TV series for HBO Romania and on his second feature movie- \"Father Moves Mountains/Tatăl mută munții\" produced by Cristian Mungiu (Mobra Films). This project received the ARTE award at Les Arcs in 2016.",
      "id": "danielsandu"
    },
    {
      "name": "Elena Beuca",
      "imagePath": "elena_beuca.jpg",
      "details": "Elena Beuca grew up in a small farm town in Transylvania, Romania. After graduating from Law School in Bucharest and working in real estate for a few years, she became interested in the entertainment industry and decided to move to Hollywood. Elena studied at the American Academy of Dramatic Arts. She studied with Ivanna Chubuck, the famous acting coach for Charlize Theron, Halle Berry, Brad Pitt. She has appeared in the HBO comedy series \"Enlightened\", the Fox Network action drama \"Gang Related\" and Nickelodeon's \"Victorious\". Elena has always loved a good challenge, so when a friend introduced her to the 168-film festival (making a short film in a week ) she decided to jump in and direct her first short film. She loved it so much, that she decided to do it again and again and again.. D-love is her first feature film. She is currently working on another feature film that will be shot in the fall in South Carolina.",
      "id": "elena-beuca"
    }
  ]
}
